IDEA Open Model
TimePoint Class
Compatible with IDEA StatiCa 20.1
 Point on time axis
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.TimePoint
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class TimePoint : OpenObject
Public Class TimePoint
	Inherits OpenObject
The TimePoint type exposes the following members.
Constructors
Name | Description
TimePoint
 Constructor
Top
Properties
Name | Description
Age
 Age
AllowCheckInAgeLess3Days
 true to allow chec in age less 3 days
Description
 Description
Fix2DRotation
 true to fix around Y axis ( Mz is not taken into account )
LastConstructionStage
 Last construction stage - Time of the start of cyclic loading for fatigue check
Name
 Name of time point
Prestressing
 Prestressing
Stage
 Stage
Time
 Time
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace